-*- Mode: org; mode: auto-fill; fill-column: 76 -*-

#+SEQ_TODO: TODO(t) STARTED(s!) SOMEDAY(S!) WAIT(w@/!) DELEGATE(e@/!) | DONE(d!/!)  CANCELED(c@)
#+STARTUP: overview
#+STARTUP: lognotestate
#+TAGS: noexport(n) export(e)
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00

#+TITLE:     Features_Selection
#+AUTHOR:    Leandro Fernandes
#+EMAIL:     leandro_h_fernandes@cargill.com
#+DATE:      <2015-12-09 Wed>

#+LANGUAGE:  en
#+TEXT:      GTD Agenda
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:nil skip:t d:nil tags:not-in-toc
#+INFOJS_OPT: view:overview toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+LINK_UP:
#+LINK_HOME:
#+PROPERTY: Effort_ALL 0:05 0:15 0:30 0:45 1:00 1:30 2:00 3:00 4:00 5:00
#+TAGS: DATA(d) MODELLING(m) FORECASTING(f) WRITTING(w) REFACTORING(r)
#+COLUMNS: %40ITEM(Task) %TODO %17Effort(Estimated Effort){:} %CLOCKSUM %TAGS

# Local Variables:
# org-export-html-style: "   <style type=\"text/css\">
#    a:link, a:visited {font-style: italic; text-decoration: none; color: black; }
#    a:active {font-style: italic; texit-decoration: none; color: blue; } </style>
#   </style>"
# End:


#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

* Data

  One of the good things about data analysis is that you can test/check your
  ideas and learn with simulated data (Of course there is a limit for
  that). You can use simulated data to get more experience by analyzing
  data, double check if you understood a new theory or algorithm and also
  simulate scenario forecast.

  In this section, In order to test or EDA start-kit (eda library) we worked
  with simulated data. We choose linear relationship between dependent and
  independent variables because it is simple and appears very often in
  business analysis. We will work with non-linear relationship in the near
  future.

  Our data is summarized below:
  * 4 important variables 
  * 11 noise variable 
  * 2 correlated variable: x5 and x4 
  * 1 interaction relationship: x2:x3 
  * True model: 
    * $y = x1 + x1^2 + x2 + x2*x3 + x4 + \epsilon$ 
    * $\epsilon = N(0, \sigma^2)$ 
    * $\sigma^2$ is the Bayes error. 

  The code bellow loads all necessary libraries and the simulated data.

  #+begin_src R :tangle main.R :results output
    source('libs/features_selection.R')
    source('libs/data_simulator.R')

    data.size <- 128
    data.sim    <- DataSimulator(data.size)
    bayes.error = data.sim$GetSigma()
    true.model <- data.sim$GetTrueModelFormula()

    cat("Simulated data true model:\n")
    print(true.model)
    cat("Bayes error:\n")
    print(bayes.error)

    offset <- round(data.size*0.70)
    db       <- data.sim$GetData()
    train.db <- db[seq(1,offset,by=1),]
    test.db  <- db[seq(offset + 1,data.size,by=1),]
  #+end_src

  #+RESULTS:
  : Simulated data true model:
  : [1] "y ~ x1 + I(x1^2) + x2 + x2:x3 + x4"
  : Bayes error:
  : [1] 2

